Tekla.Structures.Model.LoadUniform
The LoadUniform class defines a uniformly-distributed force bounded by a polygon.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
using System;
public class Example
{
public void Example1()
{
LoadUniform L = new LoadUniform();
L.P1 = new Vector(1000,2000,3000);
L.DistanceA = 5;
L.Polygon.Points.Add(new Point(9000, 12000, 0));
L.Polygon.Points.Add(new Point(11000, 12000, 0));
L.Polygon.Points.Add(new Point(11000, 15000, 0));
L.Polygon.Points.Add(new Point(7000, 15000, 0));
L.AutomaticPrimaryAxisWeight = true;
L.BoundingBoxDx = 500;
L.BoundingBoxDy = 500;
L.BoundingBoxDz = 500;
L.LoadDispersionAngle = 3;
L.PartFilter = "testing";
L.PartNames = Load.LoadPartNamesEnum.LOAD_PART_NAMES_INCLUDE;
L.PrimaryAxisDirection = new Vector(1000, 500, 0);
L.Spanning = Load.LoadSpanningEnum.LOAD_SPANNING_SINGLE;
L.Weight = 2;
L.CreateFixedSupportConditionsAutomatically = true;
if (!L.Insert())
Console.WriteLine("LoadUniform Insert failed!");
}
}

Tekla.Structures.Model.LoadUniform._Polygon
The position points for the uniform load.

Tekla.Structures.Model.LoadUniform._P1
The P1 vector from the dialog.

Tekla.Structures.Model.LoadUniform._DistanceA
The distance a (for enlarging or reducing the loaded area).

Tekla.Structures.Model.LoadUniform.Polygon
The position points for the uniform load.

Tekla.Structures.Model.LoadUniform.P1
The load magnitude vector.
The values are given in the local coordinate system of the load (not in the current coordinate system).

Tekla.Structures.Model.LoadUniform.DistanceA
The distance a (for enlarging or reducing the loaded area).

Tekla.Structures.Model.LoadUniform.#ctor
Creates a new load uniform instance.

Tekla.Structures.Model.LoadUniform.Insert
Inserts the load uniform into the model database.
Returns: True on success.

Tekla.Structures.Model.LoadUniform.Select
Selects a load uniform from the model database. The ID must be set.
Returns: True on success.

Tekla.Structures.Model.LoadUniform.Modify
Modifies the existing load uniform in the model database to match the current one.
At the moment it is not possible to change the load attachment or the father.
Returns: True on success.

Tekla.Structures.Model.LoadUniform.Delete
Deletes the load uniform instance with the given ID from the model database.
Returns: True on success.